[
    {
        "name": "Agrahar Market",
        "dangerMsg": "Not that way, the guards are coming!",
        "welcomeMsg": "Welcome to the Agrahar Market",
        "introMsg": "You enter a bustling market. A bazaar, even. You see vendors selling earthenware, rugs, apples, and dates from an assortment of stalls and booths. You approach a nearby stall that has beautiful Persian carpets, earthenware, and ornate slippers for sale.",
        "lookMsg": "You are in a bustling market, (a bazaar, even,) with vendors selling clothing, housewares, delicious spices, and delightful oddments from an assortment of stalls and booths. At a nearby stall you see beautiful Persian carpets, earthenware, and ornate slippers for sale.",
        "description": "You are in the Agrahar Market, near a stall that sells beautiful housewares.",
        "x_cord": 2,
        "y_cord": 2,
        "isKeyLocation": true,
        "isAvailable": true,
        "midiFileName": "AgraharMarket.mid"
    },
    {
        "name": "Azure Bayou",
        "dangerMsg": "Watch out! Don't walk into the swamp.",
        "welcomeMsg": "Welcome to the Azure Bayou",
        "introMsg": "You are in front of a lush thicket. You near a tangled brush. The air becomes sultry and you are surrounded with the alluring fragrances of cypress and salty marsh air wafting on a muggy breeze. You see a small clearing lit by the moon. You enter the clearing and see within a tiny crone holding a deck of ornate tarot cards.",
        "lookMsg": "You are in a small clearing lit by the moon, near a lush thicket of tangled brush. The air is sultry and you are surrounded with the alluring fragrances of cypress and salty marsh air wafting on the muggy breeze. In the clearing is a tiny crone holding a deck of ornate tarot cards.",
        "description": "You are in a small clearing lit by the moon.",
        "x_cord": -2,
        "y_cord": -1,
        "isKeyLocation": true,
        "isAvailable": true,
        "midiFileName":  "AzureBayou.mid"
    },
  {
    "name": "Bottom of the Beanstalk",
    "dangerMsg": "The trees are too thick. You can't go that way!",
    "welcomeMsg": "Welcome to the Bottom of the Beanstalk",
    "introMsg": "You go through the huge wooden gate and into a clearing in the forest. The trees grow closely all around, but in the center of the clearing, and huge beanstalk is growing! It reaches up so high that the top of the beanstalk is hidden by a few puffy clouds. Leafy green vines climb up the beanstalk. It's really big, but since you're not afraid of heights like Jack, you think you could climb up it pretty easily.",
    "lookMsg": "You are at the base of a giant beanstalk. The beanstalk reaches up so high that the top is hidden by a few puffy clouds. Leafy green vines climb up the beanstalk. It's really big, but since you're not afraid of heights, you think you could climb up it pretty easily.",
    "description": "You are at the base of a giant beanstalk.",
    "x_cord": 0,
    "y_cord": 3,
    "isKeyLocation": false,
    "isAvailable": false,
    "midiFileName": "Forest.mid"
  },
  {
    "name": "Charming Cottage",
    "dangerMsg": "A cranky looking woman steps out of the cottage and shoos you away. You can't go that direction!",
    "welcomeMsg": "Welcome to Charming Cottage",
    "introMsg": "As you wander down the dirt path, you enter a small village. There's a castle off in the distance. You wander into the yard of the cottage at the end of the lane. The cottage itself is small, but looks well-made.",
    "lookMsg": "You are in a small village, in the yard of the cottage at the end of the lane. The cottage itself is small, but looks well-made. There's a castle off in the distance.",
    "description": "You are in the yard of the cottage at the end of the lane.",
    "x_cord": -2,
    "y_cord": 2,
    "isKeyLocation": true,
    "isAvailable": true,
    "midiFileName": "CharmingCottage.mid"
  },
  {
    "name": "Cloud Cottage",
    "dangerMsg": "You'll bump into a wall if you try to go that way.",
    "welcomeMsg": "Welcome to the Cottage in the Clouds",
    "introMsg": "You walk through the little round door and into the cottage. It's a cheerful place, full of bright sunshine. A vase of purple flowers sits on a little wooden table, and there is a neatly-made bed along the back wall. A cat with orange stripes is curled up in the middle of the bed. It looks up and you when you walk in, and then goes back to sleep. To one side is a wooden crate full of tools and bits of wood.",
    "lookMsg": "You are in the cottage in the clouds. It's a cheerful place, full of bright sunshine. A vase of purple flowers sits on a little wooden table, and there is a neatly-made bed along the back wall. A cat with orange stripes is curled up on the bed. To one side is a wooden crate full of tools and bits of wood.",
    "description": "You are in the cottage in the clouds.",
    "x_cord": 2,
    "y_cord": 4,
    "isKeyLocation": false,
    "isAvailable": true,
    "midiFileName": "Forest.mid"
  },
  {
    "name": "Cloud Dock",
    "dangerMsg": "Careful! The edge of the clouds is that way!",
    "welcomeMsg": "Welcome to the Balloon-Ship Dock",
    "introMsg": "You step off of the clouds an onto the wooden dock that extends out over the edge of the clouds. Tied at the end of the dock is a little wooden boat that is floating underneath a big ballon with red and yellow stripes. It's very windy, but the sunshine keeps you nice and warm.",
    "lookMsg": "You are standing on a wooden dock that extends out over the edge of the clouds. Tied at the end of the dock is a little wooden boat that is floating underneath a big ballon with red and yellow stripes. It's very windy!",
    "description": "You are standing on a dock in the clouds, next to a small flying boat. It's very windy!",
    "x_cord": 0,
    "y_cord": 5,
    "isKeyLocation": false,
    "isAvailable": true,
    "midiFileName": "Forest.mid"
  },
  {
    "name": "Cloud Garden",
    "dangerMsg": "Careful! The edge of the clouds is that way!",
    "welcomeMsg": "Welcome to the Garden in the Clouds",
    "introMsg": "You walk across the clouds and into the garden. Bright flowers grow all around the edges, and in the middle are rows of carrots, peas, blueberries, and pumpkins. All of them are growing right out of the clouds! On the east side of the garden is a cottage with a little round door that is painted bright blue.",
    "lookMsg": "You are standing in a garden in the clouds. Bright flowers grow all around the edges, and in the middle are rows of carrots, peas, blueberries, and pumpkins. On the east side of the garden is a cottage with a little round door that is painted bright blue.",
    "description": "You are in a garden growing in the clouds.",
    "x_cord": 1,
    "y_cord": 4,
    "isKeyLocation": false,
    "isAvailable": true,
    "midiFileName": "Forest.mid"
  },
  {
    "name": "Forest1",
    "dangerMsg": "The trees seem to push you back. Maybe you shouldn't go that way!",
    "welcomeMsg": "Welcome to the forest",
    "introMsg": "You are in a deep forest. Tall trees rise up majestically around you, so tall they seem to brush the sky. Birds are singing musically above you. Shafts of bright sunlight break through the trees here and there, illuminating your path.",
    "lookMsg": "You are in a deep forest. Tall trees rise up majestically around you, so tall they seem to brush the sky. Birds are singing musically above you. Shafts of bright sunlight break through the trees here and there, illuminating your path.",
    "description": "You are in a deep forest full of tall trees.",
    "x_cord": 0,
    "y_cord": 1,
    "isKeyLocation": false,
    "isAvailable": true,
    "midiFileName": "Forest.mid"
  },
  {
    "name": "Forest2",
    "dangerMsg": "A rough stone wall surrounds a huge pasture in that direction. You probably shouldn't go that way!",
    "welcomeMsg": "Welcome to the edge of the forest",
    "introMsg": "The forest starts to thin. You see a village in the distance to the west.",
    "lookMsg": "You are on the edge of the forest, where the lofty trees of the deep woods give way to rolling hills and farmland. Off in the distance to the west, you see a small village.",
    "description": "The forest is thinner here. You see a village in the distance to the west.",
    "x_cord": -1,
    "y_cord": 2,
    "isKeyLocation": false,
    "isAvailable": true,
    "midiFileName": "Forest.mid"
  },
  {
    "name": "Forest3",
    "dangerMsg": "The heavy wooden gate is locked. You can't go that way!",
    "welcomeMsg": "Welcome to the forest",
    "introMsg": "You are in a deep forest. The trees here are tall and majestic, but they grow closer together, with branches so entwined they make a fence.",
    "lookMsg": "You are in a deep forest. The trees here are tall and majestic, but they grow closer together, with branches so entwined they make a fence. A huge wooden gate with an iron lock stands in the tree fence to the north. There seems to be a beanstalk on the other side of the gate.",
    "description": "The trees are much thicker here, with branches so entwined they make a fence. A huge wooden gate blocks the way north.",
    "x_cord": 0,
    "y_cord": 2,
    "isKeyLocation": false,
    "isAvailable": true,
    "midiFileName": "Forest.mid"
  },
  {
    "name": "Forest4",
    "dangerMsg": "There's nothing but trackless sand in that direction. You'd get lost if you went that way!",
    "welcomeMsg": "Welcome to the Outskirts of an Arabian city",
    "introMsg": "You find yourself walking on a sandy dune. Across the sand to the east you see the spires of a city. The forest is off to the west.",
    "lookMsg": "You are walking on a sandy dune. The sun shines down brightly on you. Across the dunes to the east you see the spires of a magnificent city. To the west, the sand dunes give way into the forest.",
    "description": "You are walking on a sandy dune.",
    "x_cord": 1,
    "y_cord": 2,
    "isKeyLocation": false,
    "isAvailable": true,
    "midiFileName": "Forest.mid"
  },
  {
    "name": "Forest5",
    "dangerMsg": "There's nothing but trackless sand in that direction. You'd get lost if you went that way!",
    "welcomeMsg": "Welcome to the Outskirts of an Arabian city",
    "introMsg": "You find yourself walking on a sandy dune. Across the sand to the north you see the spires of a city. The forest is off to the south.",
    "lookMsg": "You are walking on a sandy dune. The sun shines down brightly on you. Across the dunes to the north you see the spires of a magnificent city. To the south, the sand dunes give way into the forest.",
    "description": "You are walking on a sandy dune.",
    "x_cord": 2,
    "y_cord": 1,
    "isKeyLocation": false,
    "isAvailable": true,
    "midiFileName": "Forest.mid"
  },
  {
    "name": "Forest6",
    "dangerMsg": "The mountain hillside is too steep to go that way!",
    "welcomeMsg": "Welcome to the Mountain Outskirts",
    "introMsg": "You find yourself surrounded by evergreens bending under the weight of thick coats of snow. Snow on the path crunches under your feet. A mountain ascends to your south.",
    "lookMsg": "You are surrounded by evergreens bending under the weight of thick coats of snow. The sharp scent of evergreen needles perfumes the air. Snow dusts the trail around you, crunching softly under your feet. A castle glitters like crystal on the side of the tall mountain to the south.",
    "description": "You are surrounded by evergreens bending under the weight of thick coats of snow.",
    "x_cord": 2,
    "y_cord": 0,
    "isKeyLocation": false,
    "isAvailable": true,
    "midiFileName": "Forest.mid"
  },
  {
    "name": "Forest7",
    "dangerMsg": "The trees seem to push you back. Maybe you shouldn't go that way!",
    "welcomeMsg": "Welcome to the forest",
    "introMsg": "You are in a deep forest. Tall trees rise up majestically around you, so tall they seem to brush the sky. Birds are singing musically above you. Shafts of bright sunlight break through the trees here and there, illuminating your path.",
    "lookMsg": "You are in a deep forest. Tall trees rise up majestically around you, so tall they seem to brush the sky. Birds are singing musically above you. Shafts of bright sunlight break through the trees here and there, illuminating your path.",
    "description": "You are in a deep forest full of tall trees.",
    "x_cord": 1,
    "y_cord": 1,
    "isKeyLocation": false,
    "isAvailable": true,
    "midiFileName": "Forest.mid"
  },
  {
    "name": "Forest8",
    "dangerMsg": "The trees seem to push you back. Maybe you shouldn't go that way!",
    "welcomeMsg": "Welcome to the forest",
    "introMsg": "You are in a deep forest. Tall trees rise up majestically around you, so tall they seem to brush the sky. Birds are singing musically above you. Shafts of bright sunlight break through the trees here and there, illuminating your path.",
    "lookMsg": "You are in a deep forest. Tall trees rise up majestically around you, so tall they seem to brush the sky. Birds are singing musically above you. Shafts of bright sunlight break through the trees here and there, illuminating your path.",
    "description": "You are in a deep forest full of tall trees.",
    "x_cord": 1,
    "y_cord": 0,
    "isKeyLocation": false,
    "isAvailable": true,
    "midiFileName": "Forest.mid"
  },
  {
    "name": "Forest9",
    "dangerMsg": "The trees seem to push you back. Maybe you shouldn't go that way!",
    "welcomeMsg": "Welcome to the forest",
    "introMsg": "You are in a deep forest. Tall trees rise up majestically around you, so tall they seem to brush the sky. Birds are singing musically above you. Shafts of bright sunlight break through the trees here and there, illuminating your path.",
    "lookMsg": "You are in a deep forest. Tall trees rise up majestically around you, so tall they seem to brush the sky. Birds are singing musically above you. Shafts of bright sunlight break through the trees here and there, illuminating your path.",
    "description": "You are in a deep forest full of tall trees.",
    "x_cord": -1,
    "y_cord": 0,
    "isKeyLocation": false,
    "isAvailable": true,
    "midiFileName": "Forest.mid"
  },
  {
    "name": "Forest10",
    "dangerMsg": "The water gets a lot deeper in that direction. Maybe you shouldn't go that way!",
    "welcomeMsg": "Welcome to the outskirts of the swamp",
    "introMsg": "You find yourself wading through cypress trees. Fortunately, the water never gets deeper than your knees! The sky is slowly fading into twilight. To the west, you can see some lights glowing through the swamp.",
    "lookMsg": "You are wading among cypress trees. Fortunately, the water never gets deeper than your knees! You see frogs swimming here and there around you. Occasionally you see a snake hanging out of a tree, and then a water moccasin swims by your legs and disappears! The sky is slowly fading into twilight. To the west, you can see some lights glowing through the swamp.",
    "description": "You are wading among cypress trees.",
    "x_cord": -1,
    "y_cord": -1,
    "isKeyLocation": false,
    "isAvailable": true,
    "midiFileName": "Forest.mid"
  },
  {
    "name": "Forest11",
    "dangerMsg": "A deep river blocks the way in that direction.",
    "welcomeMsg": "Welcome to the edge of the forest",
    "introMsg": "The forest starts to thin. You see a village in the distance to the north.",
    "lookMsg": "You are on the edge of the forest, where the lofty trees of the deep woods give way to rolling hills and farmland. Off in the distance to the north, you see a small village. To the south, you can see the beginnings of a swamp.",
    "description": "The forest is thinner here. You see a village in the distance to the north.",
    "x_cord": -2,
    "y_cord": 1,
    "isKeyLocation": false,
    "isAvailable": true,
    "midiFileName": "Forest.mid"
  },
  {
    "name": "Forest12",
    "dangerMsg": "The water gets a lot deeper in that direction. Maybe you shouldn't go that way!",
    "welcomeMsg": "Welcome to the outskirts of the swamp",
    "introMsg": "You find yourself wading through cypress trees. Fortunately, the water never gets deeper than your knees! The sky is slowly fading into twilight. To the south, you can see some lights glowing through the swamp.",
    "lookMsg": "You are wading among cypress trees. Fortunately, the water never gets deeper than your knees! You see frogs swimming here and there around you. Occasionally you see a snake hanging out of a tree, and then a water moccasin swims by your legs and disappears! The sky is slowly fading into twilight. To the south, you can see some lights glowing through the swamp. To the north, you can see rolling farmlands.",
    "description": "You are wading among cypress trees.",
    "x_cord": -2,
    "y_cord": 0,
    "isKeyLocation": false,
    "isAvailable": true,
    "midiFileName": "Forest.mid"
  },
  {
    "name": "Forest13",
    "dangerMsg": "The trees seem to push you back. Maybe you shouldn't go that way!",
    "welcomeMsg": "Welcome to the forest",
    "introMsg": "You are in a deep forest. Tall trees rise up majestically around you, so tall they seem to brush the sky. Birds are singing musically above you. Shafts of bright sunlight break through the trees here and there, illuminating your path.",
    "lookMsg": "You are in a deep forest. Tall trees rise up majestically around you, so tall they seem to brush the sky. Birds are singing musically above you. Shafts of bright sunlight break through the trees here and there, illuminating your path.",
    "description": "You are in a deep forest full of tall trees.",
    "x_cord": -1,
    "y_cord": 1,
    "isKeyLocation": false,
    "isAvailable": true,
    "midiFileName": "Forest.mid"
  },
  {
    "name": "Forest14",
    "dangerMsg": "The trees seem to push you back. Maybe you shouldn't go that way!",
    "welcomeMsg": "Welcome to the forest",
    "introMsg": "You are in a deep forest. The trees here are tall and majestic, but they seem to cluster together, as if they were a crowd of weird, wooden people. Their gnarled branches are so wound together that the way south seems blocked.",
    "lookMsg": "You are in a deep forest. The trees here are tall and majestic, but they seem to cluster together, as if they were a crowd of weird, wooden people. Their gnarled branches are so wound together that the way south seems blocked.",
    "description": "The trees here are weird, with branches so entwined they seem to be holding hands.",
    "x_cord": 0,
    "y_cord": -1,
    "isKeyLocation": false,
    "isAvailable": true,
    "midiFileName": "Forest.mid"
  },
  {
    "name": "Forest15",
    "dangerMsg": "The mountain hillside is too steep to go that way!",
    "welcomeMsg": "Welcome to the Mountain Outskirts",
    "introMsg": "You find yourself surrounded by evergreens bending under the weight of thick coats of snow. Snow on the path crunches under your feet. To the east, a mountain grows tall.",
    "lookMsg": "You are surrounded by evergreens bending under the weight of thick coats of snow. The sharp scent of evergreen needles perfumes the air. Snow dusts the trail around you, crunching softly under your feet. A castle glitters like crystal on the side of the tall mountain to the east.",
    "description": "You find yourself surrounded by evergreens bending under the weight of thick coats of snow.",
    "x_cord": 1,
    "y_cord": -1,
    "isKeyLocation": false,
    "isAvailable": true,
    "midiFileName": "Forest.mid"
  },
  {
    "name": "Ice Castle",
    "dangerMsg": "Careful, don't walk off of that icy cliff!",
    "welcomeMsg": "Welcome to the Ice Castle",
    "introMsg": "An enormous sparkling castle lies ahead. It appears to be made out of ice and blends into the snow-capped mountains beyond. Seeing no one about, you knock on the castle door. No one answers. But, since you are by trade an adventurer, you try the door. It is unlocked. You enter the castle and look around.\n\nYou are standing under a crystal chandelier (or is it ice?) and a magnificent staircase arches away from the front door. Everything appears to be made of ice. A sparkling figure is standing at the top of the staircase. It's the Snow Queen!",
    "lookMsg": "You are standing in the entrance hall of a glittering ice castle. Above you is a huge crystal chandelier. Or maybe it's made of ice, too? A magnificent staircase arches away from the front door. Everything smells clean and cold. You can see your breath in the frosty air.",
    "description": "You are standing in the entrance hall of a glittering ice castle.",
    "x_cord": 2,
    "y_cord": -1,
    "isKeyLocation": true,
    "isAvailable": true,
    "midiFileName": "IceCastle.mid"
  },
  {
    "name": "Start",
    "dangerMsg": "",
    "welcomeMsg": "Welcome to the beginning",
    "introMsg": "You are in a whole new world. Welcome, adventurer!\n\nPlease unfasten your seatbelt. Keep all hands and arms outside at all times. And enjoy the journey!\n\nYou are standing on top of a small hill in the middle of a huge forest. The sun shines down warmly, and the day seems perfect for an adventure!\n\nYou feel in your pocket. (You have pockets!) What's this? A passport? The passport has four empty pages. Hmmm.",
    "lookMsg": "You are where your adventure began, on top of a small hill in the middle of a huge forest. The sun shines down warmly, and the day is definitely perfect for continuing your adventure!",
    "description": "You are back where your adventure began, on top of a small hill in the middle of a huge forest.",
    "x_cord": 0,
    "y_cord": 0,
    "isKeyLocation": false,
    "isAvailable": true,
    "midiFileName": "Start.mid"
  },
  {
    "name": "Top of the Beanstalk",
    "dangerMsg": "Careful! The edge of the clouds is that way!",
    "welcomeMsg": "Welcome to the Top of the Beanstalk",
    "introMsg": "You climb up the beanstalk, and into the clouds. It's a little cold and wet, but when climb back into the sunlight, you see that next to you, the clouds are flat, like the ground! You can even step onto them! In fact, there's a little garden planted in the clouds to the east, and a little house beyond the garden!\n\nTo the north is...you're not sure what it is! It looks like a boat with a big balloon attached to the top, floating next to a little wooden dock built right into the clouds.",
    "lookMsg": "You are at the top of the beanstalk, that is growing up through a hole in the clouds. You are standing on clouds that feel like solid ground! There is a little cloud garden and a cottage off to the east, and a wooden dock to the north. The beanstalk is growing through a hole in the clouds.",
    "description": "You are at the top of the giant beanstalk, standing on the clouds.",
    "x_cord": 0,
    "y_cord": 4,
    "isKeyLocation": false,
    "isAvailable": true,
    "midiFileName": "Forest.mid"
  }
]
